# Introduction to Analytical SQL Cell

The installation of `asqlcell` with latest version is simple as:

In [ ]:
%pip install asqlcell --upgrade

Analytical SQL Cell supports loading data from external CSV file with *inline* magic `%sql`. You can write SQL statement after the magic and the result set will be stored in the variable as a Pandas dataframe:

In [2]:
import asqlcell

data1 = %sql SELECT * FROM 'introduction.csv'

We can further join `data1` with another Pandas dataframe:

In [3]:
from asqlcell import utils

data2 = utils.get_random_data(1000)

data1.join(data2, lsuffix='id', rsuffix='id')

   idid    priceid  normalid  idid  priceid  normalid
0     0  94.830479      True     0        0      True
1     1  72.969358      True     1        1      True
2     2  59.427536      True     2        2      True
3     3   8.669261      True     3        3      True
4     4  11.028436      True     4        4      True

Analytical SQL Cell also supports *block* magic `%%sql` so that you can fill SQL statement in the whole cell. The result set will be stored in the variable named `sqlcelldf` specified after the magic:

In [4]:
%%sql sqlcelldf

SELECT *
FROM data1 JOIN data2 ON (data1.id = data2.id)

SqlcellWidget(column_sort=('', 0), data_grid='{"columns":["id","price","normal","id_2","price_2","normal_2"],"â€¦